EDT/УТ/src/Documents/новаРегистрацияДоходовРасходов/новаРегистрацияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаРегистрацияДоходовРасходов</name>
  <registerRecords>AccumulationRegister.новаНераспределенныеДоходыРасходыМестнойДоставки</registerRecords>
  <attributes>
    <name>ОтноситьНаОбъект</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Доход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоходыРасходы</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.новаСтатьиДоходовРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/новаНераспределенныеДоходыРасходыМестнойДоставки/новаНераспределенныеДоходыРасходыМестнойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>новаНераспределенныеДоходыРасходыМестнойДоставки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.новаСтатьиДоходовРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/новаРегистрацияДоходовРасходов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Транспорт = Неопределено;
	Водитель = Неопределено;
	Экспедитор = Неопределено;
	
	Если ТипЗнч(ОтноситьНаОбъект) = Тип("СправочникСсылка.новаТранспорт") Тогда
		Транспорт = ОтноситьНаОбъект;
	
	ИначеЕсли ТипЗнч(ОтноситьНаОбъект) = Тип("СправочникСсылка.новаВодители") Тогда
		Водитель = ОтноситьНаОбъект;
	
	ИначеЕсли ТипЗнч(ОтноситьНаОбъект) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда
		Экспедитор = ОтноситьНаОбъект;
		
	КонецЕсли;
	
	Для Каждого стрДоходРасход Из ДоходыРасходы Цикл
		Если стрДоходРасход.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		Движение = Движения.новаНераспределенныеДоходыРасходыМестнойДоставки.Добавить();
		Движение.Период = Дата;
		Движение.Транспорт = Транспорт;
		Движение.Водитель = Водитель;
		Движение.Экспедитор = Экспедитор;
		Движение.Статья = стрДоходРасход.Статья;
		Движение.Сумма = стрДоходРасход.Сумма;
	КонецЦикла;
КонецПроцедуры
